Revit 2027 API
ParameterTypeId.SketchingOffsetTo Property
 "Offset To"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SketchingOffsetTo { get; }
Public Shared ReadOnly Property SketchingOffsetTo As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SketchingOffsetTo {
	ForgeTypeId^ get ();
}
static member SketchingOffsetTo : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace